Tekla Open API Reference for Tekla Structures 2025
OBB.Intersects Method
Overload List
Name | Description
Intersects(GeometricPlane)
 Tests if current OBB intersects with the given GeometricPlane
Intersects(Line)
 Tests if current OBB intersects with the given Line
Intersects(LineSegment)
 Tests if current OBB intersects with the given LineSegment
Intersects(OBB)
 Tests if current OBB intersects with the given OBB
Top
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace